Revit 2015 API
SolidUtils Methods
The SolidUtils type exposes the following members.
Methods
Name | Description
IsValidForTessellation
 Tests if the input solid or shell is valid for tessellation.
SplitVolumes
 Splits a solid geometry into several separate solids.
TessellateSolidOrShell
 This function facets (i.e., triangulates) a solid or an open shell. Each boundary component of the solid or shell is represented by a single triangulated structure.
See Also
SolidUtils Class
Autodesk.Revit.DB Namespace